<?php

use Illuminate\Database\Seeder;

class StoryTableSeeder extends Seeder
{
    public function run()
    {
        DB::table('stories')->insert([
            [
                'category' => "ইতিহাস",
                'name' => "নবাব সিরাজ-উদ-দৌলা",
                'image' => "images/upload/siraj-ud-daulah.jpg",
                'details' => "নবাব সিরাজ-উদ-দৌলা বা মির্জা মুহাম্মাদ সিরাজ-উদ-দৌলা (জন্ম: ১৭৩২ - মৃত্যু: ১৭৫৭) 
                বাংলা-বিহার-উড়িষ্যার শেষ স্বাধীন নবাব। পলাশীর যুদ্ধে তাঁর পরাজয় ও মৃত্যুর পরই ভারতবর্ষে ১৯০ বছরের ইংরেজ-শাসনের 
                সূচনা হয়। সিরাজউদ্দৌলা তার নানা নবাব আলীবর্দী খান-এর কাছ থেকে ২২ বছর বয়সে ১৭৫৬ সালে 
                বাংলার নবাবের ক্ষমতা অর্জন করেন। তার সেনাপতি মীরজাফর বিশ্বাসঘাতকতার কারনে ২৩ জুন ১৭৫৭ সালে 
                পলাশীর যুদ্ধে পরাজিত হন। রবার্ট ক্লাইভের নেতৃত্বে ইস্ট ইন্ডিয়া কোম্পানি বাংলার শাসনভার গ্রহন করে। 
                নবাব সিরাজ-উদ-দৌলা ছিলেন বাংলার নবাব আলীবর্দী খান-এর নাতি। সিরাজ-উদ-দৌলার জন্মতারিখ বা সাল 
                নিয়ে মতপার্থক্য রয়েছে। তবে অধিক গ্রহণযোগ্য মত হলো সিরাজ-উদ-দৌলা ১৭৩২ সালে জন্মগ্রহণ করেন।",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "খেলাধুলা",
                'name' => "তামিম ইকবাল খান",
                'image' => "images/upload/tamim.png",
                'details' => "চট্টগ্রামে জন্মগ্রহণকারী বাংলাদেশী ক্রিকেটার (জন্ম: ২০ মার্চ, ১৯৮৯) 
                তামিম ইকবাল প্রিমিয়ার লীগে চট্টগ্রাম বিভাগীয় দলের হয়ে প্রথম-শ্রেণীর ক্রিকেট খেলেন। 
                তিনি ক্রিকেটার নাফিস ইকবালের ভাই এবং বাংলাদেশের জনপ্রিয় ক্রিকেট তারকা আকরাম খানের ভাতিজা। 
                মার্চ, ২০১৫ তারিখ মোতাবেক তিনি একদিনের আন্তর্জাতিকে ৪,০০০ রান সংগ্রহকারী দ্বিতীয় বাংলাদেশী 
                ক্রিকেটার এবং ২০১৬ মোতাবেক ওডিআইতে ৫০০০ রান এবং ২০১৮ মোতাবেক ৬০০০ রান সংগ্রহকারী প্রথম বাংলাদেশি।
                মুশফিকুর রহিমের পর তামিম ইকবাল বাংলাদেশের ২য় ক্রিকেটার হিসাবে টেস্টে দ্বি-শতক রান করেছেন৷ 
                তাছাড়াও ২০১৬ টি টোয়েন্টি বিশ্বকাপে ওমানের বিপক্ষে ১ম বাংলাদেশী ক্রিকেটার হিসেবে টি টোয়েন্টি তে শতক রান 
                করেছেন এবং প্রথম বাংলাদেশী হিসেবে টি টোয়েন্টি ইন্টারন্যাশনাল তে ১০০০ রান সংগ্রহ করেন। ২০১২ সালের মার্চে 
                তামিম আইপিএলের পুনে ওয়ারিয়র্স ক্রিকেট দলে যোগ দেন।" ,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "খেলাধুলা",
                'name' => "বাংলাদেশ জাতীয় ক্রিকেট দল",
                'image' => "images/upload/BD-team.jpg",
                'details' => "বাংলাদেশ ক্রিকেট দল আন্তর্জাতিক ক্রিকেটে জাতীয় ক্রিকেট দল হিসেবে বাংলাদেশের প্রতিনিধিত্ব করে। 
                তারা বেঙ্গল টাইগার নামেও পরিচিত। বাংলাদেশ ক্রিকেট বোর্ড (সংক্ষেপে বিসিবি) এই দল পরিচালনা করে। 
                বাংলাদেশ ১৯৭৭ সালে আন্তর্জাতিক ক্রিকেট সংস্থার (আইসিসি) সহযোগী সদস্যে পরিণত হয়। 
                পরবর্তীতে রাকিবুল হাসানের নেতৃত্বে ১৯৭৯ সালে ইংল্যান্ডে অনুষ্ঠিত আইসিসি ট্রফিতে অংশগ্রহণ করার মাধ্যমে 
                বিশ্ব ক্রিকেটে আত্মপ্রকাশ করে। গাজী আশরাফ হোসেন লিপু'র নেতৃত্বে এশিয়া কাপ ক্রিকেটে ১৯৮৬ সালের 
                ৩১শে মার্চ বাংলাদেশ সর্বপ্রথম আন্তর্জাতিক একদিনের ক্রিকেটে পাকিস্তানের বিপক্ষে অংশগ্রহণ করে।
                আয়োজক দেশ হিসেবে বাংলাদেশ ১৯৮৮ সালের এশিয়া কাপে অংশগ্রহণ করে। এটাই ছিল বাংলাদেশে অনুষ্ঠিত 
                সর্বপ্রথম আন্তর্জাতিক একদিনের ক্রিকেট প্রতিযোগিতা। ভয়াবহ বন্যা সত্ত্বেও বাংলাদেশ আয়োজক হিসেবে 
                সফলতার পরিচয় দেয়। বিভিন্ন আন্তর্জাতিক প্রতিযোগিতায় অংশগ্রহণের পর বাংলাদেশ একদিনের আন্তর্জাতিক 
                ক্রিকেটে প্রথম জয়ের দেখা পায় ১৯৯৮ সালে কেনিয়ার বিপক্ষে ভারতে অনুষ্ঠিত খেলায় বাংলাদেশ এই জয়লাভ করে।
                ১৯৯৭ সালে আইসিসি ট্রফি জেতার মাধ্যমে বাংলাদেশ ১৯৯৯ সালে ইংল্যান্ডে অনুষ্ঠিত বিশ্বকাপ খেলার সুযোগ পায় এবং 
                আন্তর্জাতিক ক্রিকেট সংস্থার নিয়মিত সদস্য পদ লাভ করে। প্রথমবার বিশ্বকাপে অংশগ্রহণ করেই বিশ্বকে তাক লাগিয়ে দেয় 
                বাংলাদেশ ১৯৯২ সালের বিশ্বকাপজয়ী পাকিস্তানকে ৬২ রানে পরাজিত করে। স্কটল্যান্ড এবং পাকিস্তানকে হারানোর পরে 
                এই জয় বাংলাদেশকে আন্তর্জাতিক টেস্ট দলের সদস্য হতে সহায়তা করে।",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "ছোট গল্প",
                'name' => "এক গ্লাস দুধ",
                'image' => "images/upload/BD-team.jpg",
                'details' => "দরিদ্র ছেলেটা লেখাপড়ার খরচ যোগাতে মানুষের দ্বারে দ্বারে গিয়ে হকারি করত। 
                একবার প্রচুর খিদে নিয়ে সে এক রমণীর দরজায় গেলেও লজ্জায় খিদের কথা না বলে এক গ্লাস পানি চাইল।
                রমণী বুঝতে পেরে তার জন্য এক গ্লাস পানির বদলে এক গ্লাস দুধ নিয়ে এল। ছেলেটা তার দাম দিতে চাইলে 
                রমণী তা নিতে অসম্মতি জানালেন। ঐদিন ঐ ছেলে শুধুমাত্র ভরপেটেই ঐ বাড়ী থেকে বের হয়নি বরং 
                বেরিয়েছে অনেক অনুপ্রেরণা এবং শ্রদ্ধা নিয়ে। অনেক বছর পর, বড় শহরের, বিরাট এক ডাক্তার হাওয়ার্ড কেলি 
                এক মৃতপ্রায় রোগীর চিকিৎসায় নিয়োজিত হলেন। রোগীর গ্রামের নাম শুনে তিনি তার শৈশবে সেই গ্রামের এক 
                রমণীর থেকে পাওয়া অসীম স্নেহের কথা স্মরণ করে আবেগে আপ্লুত হয়ে গেলেন এবং সাথে সাথে তিনি 
                রোগীকেও চিনে ফেললেন, আরেহ! এতো সেই রমণী! কেলি তাঁর সর্বোচ্চ চেষ্টা দিয়ে সেই রমণীকে সুস্থ করে 
                তুললেন কিন্তু রমণীর হাসপাতালের খরচ দেবার মত সামর্থ্য ছিল না। তিনি কাউন্টারে গিয়ে দেখলেন, ডা. কেলি ইতোমধ্যে 
                তার হাসপাতালের দেনা চুকিয়ে দিয়েছেন এবং তার বিলের কাগজে লিখে দিয়ে গেছেন, “Paid in full with a glass of milk”
                আমরা জীবনে যাই করি না কেন, সবকিছুরই প্রতিদান আমাদের জন্য অপেক্ষা করছে। হোক না একটু দেরি! 
                এই রমণী কি কখনো ভেবেছিলেন যে সে এভাবে এত বছর পর তার প্রতিদান পাবেন?",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "অলীক কাহিনী",
                'name' => "ঈগল ও শেয়াল",
                'image' => "images/upload/BD-team.jpg",
                'details' => "এক ঈগল এক শেয়ালছানা ধরে নিয়ে চলল। শেয়াল মা গভীর দুঃখে অনেক কাকুতিমিনতি করল। 
                কিন্তু ঈগল তা শুনল না। সে ভাবল অনেক উঁচুতে পাইন গাছে আমার বাসা। শেয়াল আমার কী আর ক্ষতি করতে পারবে? 
                সে আমার নাগালই পাবে না। এই ভেবে ছানাটিকে নিয়ে চলল। শেয়াল মা দৌড়ে গেল মাঠে, লোকের কাছ থেকে 
                আগুন নিয়ে পাইন গাছে বয়ে আনল। সে সবে গাছে আগুন লাগাতে যাচ্ছে। এমন সময় ঈগল ক্ষমা চেয়ে তাকে 
                তার বাচ্চা ফেরত দিল।",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "তথ্য প্রযুক্তি",
                'name' => "এরোপ্লেন আবিষ্কার",
                'image' => "images/upload/BD-team.jpg",
                'details' => "বিমান একপ্রকার যন্ত্র যা বায়ুর উপর ভর করে উড়তে সক্ষম হয়। 
                এটি এয়ারফয়েলের স্থির উত্তোলন বা গতিশীল উত্তোলন অথবা কিছু ক্ষেত্রে জেট ইঞ্জিনের নিম্নমুখী ধাক্কা 
                দ্বারা অভিকর্ষের বিপরীতে ক্রিয়া করে। বেশিরভাগ ক্ষেত্রে বিমান চালিত হয় এতে উপস্থিত বৈমানিক কর্তৃক, 
                তবে অনেক ক্ষেত্রে মনুষ্যবিহীন উড়োযানগুলো নিয়ন্ত্রিত হয় দূর হতে রিমোট দিয়ে অথবা বিমানে উপস্থিত 
                কম্পিউটারের স্বনিয়ন্ত্রণের মাধ্যমে। বিভিন্ন ক্ষেত্রের সাপেক্ষে বিমানসমূহকে বিভিন্নভাবে শ্রেণীকরণ করা যায়, 
                যেমন- উত্তোলনের ধরণ, ইঞ্জিনের চালনশক্তি, ব্যবহার কিংবা অন্যান্য। এরোপ্লেন আবিষ্কার করেন অরভিল এবং 
                উইলবার রাইট ১৯০৩ সালে।",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'category' => "সমসাময়িক",
                'name' => "চীনের ম্যাগলেভ ট্রেন",
                'image' => "images/upload/BD-team.jpg",
                'details' => "নিরাপদ স্থল যোগাযোগে ট্রেনের বিকল্প নেই। তবে গতির দিক থেকে এই ব্যবস্থা কিছুটা 
                হলেও পিছিয়ে। এ ক্ষেত্রে বুলেট ট্রেন বা ম্যাগলেভ ট্রেন অবশ্য ব্যতিক্রম। তবে বিশ্বে হাতে গোনা তিনটি 
                দেশেই রয়েছে এই ট্রেনব্যবস্থা। তার একটি চীন। অপর দুটি জাপান ও দক্ষিণ কোরিয়া। এবার চীন নতুন 
                একটি ম্যাগলেভ ট্রেনের ঘোষণা দিয়েছে, যা ঘণ্টায় ৬০০ কিলোমিটার গতিতে ছুটবে। ম্যাগলেভ ট্রেনের বিশেষত্ব 
                হলো ঘর্ষণ এড়াতে এটি চুম্বকীয় শক্তি ব্যবহার করে রেললাইন থেকে কিছুটা ওপরে ভেসে চলে। চীনের পূর্বাঞ্চলীয় 
                শহর কিংদাওয়ে নতুন ম্যাগলেভ ট্রেনটির নকশার নমুনা উন্মোচন করা হয়। দেশটির রাষ্ট্রায়ত্ত রেল কোম্পানি চায়না 
                রেলওয়ে রোলিং স্টক করপোরেশন (সিআরআরসি) এই নকশা তৈরি করেছে। প্রতিষ্ঠানটি জানিয়েছে, পরীক্ষা-নিরীক্ষা 
                শেষে ২০২১ সাল নাগাদ এই ট্রেনের বাণিজ্যিক উৎপাদনে যাবে তারা। প্রায় তিন বছর গবেষণার পর নতুন ট্রেনের 
                নকশাটি প্রস্তুত করা গেছে। উচ্চগতি অর্জনের ক্ষেত্রে প্রযুক্তিগত প্রধান বাধা হলো ট্রেনের ওজন হালকা রাখা এবং 
                ঘর্ষণ কমানো। অবশেষে গবেষকেরা সফল হয়েছেন। ঘণ্টায় ৬০০ কিলোমিটার গতির বুলেট ট্রেন অবশ্য 
                এবারই প্রথম নয়। জাপান ২০১৫ সালে প্রথম এমন ট্রেনের পরীক্ষা চালায়। ঘণ্টায় ৬০৩ কিলোমিটার গতি 
                অর্জন করে ওই ট্রেন বিশ্ব রেকর্ডও গড়ে। তবে জাপান ট্রেনটির বাণিজ্যিক উৎপাদনে যেতে পারেনি। ওই ট্রেন 
                চলাচলের জন্য উপযোগী চুও শিনকানসেন ম্যাগলেভ লাইন নির্মাণকাজ চলছে দেশটিতে। ২০২৭ সালে এটি সম্পন্ন হবে।
                ",
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ]
        ]);
    }
}
